{
  "version_id": "092c34eb-dad3-47a6-b418-6e8b89792d43",
  "items": [
    {
      "group_id": "G09",
      "error_code": "E26",
      "process_analysis": "В документе нет упоминания о демонтируемых материалах. Не указано, производится ли демонтаж, что происходит с извлеченным оборудованием, его объем или судьба. Отсутствует как описание процесса, так и прямое заявление о том, что демонтаж не предусмотрен.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E26 нарушено: отсутствует информация о судьбе демонтируемых материалов или прямое указание на отсутствие демонтажа.",
          "line_start": null,
          "suggested_fix": "Добавить фразу: «Демонтаж оборудования не предусмотрен» или, если требуется, указать объем, способ утилизации/возврата и ответственных."
        }
      ]
    },
    {
      "group_id": "G04",
      "error_code": "E08",
      "process_analysis": "В документе отсутствует отдельный раздел с условиями оказания услуг или выполнения работ. Нет информации о точной локации (помимо упоминания ЛПЦ-1), графике проведения работ, окнах доступа, порядке допуска, пропускном режиме или требованиях безопасности. Указание на цех без деталей недостаточно для планирования и проверки.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Такие данные необходимы для планирования, согласования и проверки выполнения работ на производственной площадке.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Условия выполнения работ» с указанием точного адреса и схемы размещения, графика (смены, окна), порядка допуска, пропускного режима и требований безопасности."
        }
      ]
    },
    {
      "group_id": "G07",
      "error_code": "E14",
      "process_analysis": "В тексте ТЗ упоминается только одно приложение — Приложение 1. Однако в тексте нет других ссылок на приложения, и не указано, все ли необходимые документы включены. При этом в описании E14 требуется единый перечень приложений с точными названиями и приложением файлов или ссылками. Отсутствует подтверждение, что все упомянутые документы (если таковые есть) включены в приложения. Приложение 1 упомянуто, но неясно, содержит ли оно сам документ или только ссылку. Нет информации о других возможных документах, на которые может идти ссылка (например, стандарты, нормативы).",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E14 нарушено из-за отсутствия подтверждённого перечня всех приложений. Необходимо явно перечислить все документы, чтобы ТЗ считалось целостным.",
          "line_start": null,
          "suggested_fix": "Добавить раздел \"Приложения\" с полным перечнем всех документов, на которые есть ссылки в ТЗ. Указать точные названия, реквизиты и приложить файлы или рабочие ссылки на открытые источники."
        }
      ]
    },
    {
      "group_id": "G07",
      "error_code": "E18",
      "process_analysis": "В ТЗ существует раздел 4.8 «Требования к технико-коммерческому предложению», на который есть ссылка в содержании. Однако в предоставленном фрагменте документа содержимое этого раздела отсутствует — текст обрывается на разделе 4.7. Таким образом, невозможно проверить, содержит ли раздел 4.8 исчерпывающие требования к формату и содержанию технического предложения. Отсутствие текста раздела делает невозможным подтверждение его корректности.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Раздел упомянут, но его содержание отсутствует в предоставленном фрагменте. Это делает ТЗ неполным и несоответствующим требованию E18.",
          "line_start": null,
          "suggested_fix": "Проверить наличие и полноту раздела 4.8. Убедиться, что в нём перечислены все обязательные разделы технико-коммерческого предложения, указаны форматы файлов, порядок подачи, требования к графикам и подписям."
        }
      ]
    },
    {
      "group_id": "G02",
      "error_code": "E03",
      "process_analysis": "В документе отсутствует отдельный раздел с заголовком «Предмет ТЗ», «Состав поставки» или аналогичным. Информация о предмете закупки рассеяна по тексту: в разделе «Общие сведения» указаны конструирование, поставка оборудования и разработка ПО, в разделе «Предпосылки» — внедрение ИТ-системы, интеграция с MES. Однако нет единого структурированного перечня, объединяющего оборудование, работы, ПО, документацию и ЗИП. Отсутствуют явные группы: объект, услуги, документы.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Отсутствие единого структурированного описания предмета закупки затрудняет идентификацию, приёмку и эксплуатацию системы.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Предмет ТЗ» с перечислением: 1) оборудование (камеры, серверы, датчики); 2) работы (монтаж, настройка, интеграция); 3) ПО, документация, ЗИП. Все элементы — в одном структурированном блоке."
        }
      ]
    },
    {
      "group_id": "G01",
      "error_code": "E01B",
      "process_analysis": "Структура документа в целом логична: сначала идут предпосылки, затем цели, описание текущей ситуации и требования. Однако после раздела 3.2 (стр. 19) следует раздел 4 (стр. 21), пропуская возможный обобщающий подраздел 3.3 или заключение к разделу 3. Такой скачок нарушает плавность иерархии. Кроме того, заголовки в тексте не всегда соответствуют нумерации в оглавлении — например, раздел «Описание текущей ситуации» в оглавлении указан как начинающийся на стр. 5, но в тексте начинается с [095], что может запутать читателя. Также отсутствуют явные смысловые переходы между разделами, например, от «Предпосылок» к «Целям» — нет логического моста.",
      "instances": [
        {
          "snippet": "[019] [3.2 Существующие информационные системы 11](#_Toc205454754)",
          "err_type": "invalid",
          "line_end": 19,
          "rationale": "Пропуск логического уровня иерархии (после 3.2 сразу 4) нарушает последовательность изложения. Отсутствие плавного перехода снижает читаемость и логическую связность документа.",
          "line_start": 19,
          "suggested_fix": "Добавить подраздел 3.3 «Проблемы текущей системы» или завершающий абзац после 3.2 для логического перехода к разделу 4. Убедиться, что нумерация в оглавлении соответствует фактическому расположению заголовков в тексте."
        }
      ]
    },
    {
      "group_id": "G06",
      "error_code": "E13",
      "process_analysis": "В разделе 4.11 упоминаются «Гарантийные требования», что указывает на наличие коммерческой составляющей в технической части ТЗ. Упоминание гарантийных обязательств в техническом разделе нарушает принцип разделения технических и коммерческих условий. Это может ограничивать свободную конкуренцию, так как подразумевает обязательства, относящиеся к договорным, а не техническим аспектам.",
      "instances": [
        {
          "snippet": "[043] [4.11 Гарантийные требования 24](#_Toc205454766)",
          "err_type": "invalid",
          "line_end": 43,
          "rationale": "Термин «гарантийные требования» относится к коммерческим обязательствам и не должен присутствовать в технической части ТЗ, чтобы не ограничивать конкуренцию.",
          "line_start": 43,
          "suggested_fix": "Переименовать раздел «Гарантийные требования» на «Требования к надежности и долговечности» или перенести в коммерческую часть документа."
        }
      ]
    },
    {
      "group_id": "G05",
      "error_code": "E09",
      "process_analysis": "В документе отсутствуют визуальные или семантические разделители между обязательными и желательными требованиями. Все требования представлены в едином древовидном списке без указания приоритетов. Нет отдельных секций, таблиц, колонок или маркеров, таких как «Обязательные», «Желательные» и т.п. Это делает невозможным однозначное определение приоритета каждого требования.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E09 предполагает явное визуальное или структурное разделение требований по приоритету. В текущем виде такого разделения нет, что затрудняет оценку участниками закупки.",
          "line_start": null,
          "suggested_fix": "Добавить в начало раздела 4 подразделы «4.0.1 Обязательные требования» и «4.0.2 Желательные требования» с соответствующими подзаголовками и распределить существующие пункты по ним."
        }
      ]
    },
    {
      "group_id": "G05",
      "error_code": "E10",
      "process_analysis": "Каждое требование в документе представлено без единой метки приоритета. Отсутствуют стандартные обозначения вроде «обязательное», «желательное», «ОБЯЗ», «ЖЕЛАТ» и т.п. Все пункты оформлены единообразно, но без указания категории. Это нарушает требование E10, так как отсутствие маркировки у хотя бы одного пункта считается нарушением.",
      "instances": [
        {
          "snippet": "[021] [4. Требования к информационной системе 13](#_Toc205454755)",
          "err_type": "invalid",
          "line_end": 21,
          "rationale": "Требование E10 требует единообразной маркировки приоритета для каждого требования. Отсутствие такой метки делает невозможным однозначную интерпретацию.",
          "line_start": 21,
          "suggested_fix": "Добавить после каждого заголовка требования метку в скобках, например: «(обязательное)» или «(желательное)», в зависимости от категории."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E04",
      "process_analysis": "В документе отсутствует отдельный список МТР, работ и услуг. Перечень рассыпан по тексту (например, в п. 074 упомянуты конструирование, поставка оборудования, разработка ПО), но не представлен в виде таблицы или нумерованного списка. Нет чёткой детализации, используются обобщающие формулировки. Это нарушает требование к полноте и точности.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Без структурированного перечня невозможно однозначно определить объём поставки и сравнить предложения участников.",
          "line_start": null,
          "suggested_fix": "Добавить отдельный раздел «Перечень работ, услуг и МТР» в виде таблицы с перечислением всех позиций: оборудование (камеры, серверы, ПО и т.д.), работы (монтаж, настройка, интеграция), услуги (обучение, сопровождение) без обобщений."
        }
      ]
    },
    {
      "group_id": "G09",
      "error_code": "E20",
      "process_analysis": "Упоминаются геометрические размеры листового проката (длина, ширина, толщина), но без числовых значений, диапазонов, единиц измерения или ссылок на стандарты. Нет описания марки материала, массы, физико-механических свойств изделия или исходной заготовки. Требование не выполнено.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E20 нарушено: отсутствуют числовые характеристики изделия и заготовки с единицами измерения и ссылками на стандарты.",
          "line_start": null,
          "suggested_fix": "Добавить раздел с характеристиками листового проката: тип/марка стали, диапазоны длины, ширины, толщины, массы, механические свойства, ссылки на ГОСТы или чертежи."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E05",
      "process_analysis": "В ТЗ отсутствует указание объёмов поставки: количество камер, серверов, лицензий ПО, трудозатраты и т.д. Нет ни количеств, ни методики их определения. Объёмы не указаны в тексте, таблицах или приложениях. Это делает невозможным объективное сравнение заявок.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Отсутствие объёмов или методики их определения нарушает прозрачность закупки и возможность контроля.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Объёмы поставки и работ» с указанием количества единиц оборудования, лицензий ПО, трудозатрат (чел-часы) или методики их расчёта (например, по числу линий, станков)."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E06",
      "process_analysis": "Результат упомянут (информационная система), но отсутствует конкретика: в каком виде передаётся (физические носители, доступ к серверу), формат документации, сроки передачи, критерии приёмки (например, прохождение тестов). Нет упоминания акта сдачи-приёмки или отчёта. Это делает результат неоднозначным.",
      "instances": [
        {
          "snippet": "[088] Продуктом проекта является новая информационная система автоматического обнаружения поверхностных дефектов и измерения геометрических размеров листового проката.",
          "err_type": "invalid",
          "line_end": 88,
          "rationale": "Текущая формулировка не позволяет однозначно определить, что и когда считается выполнением обязательств.",
          "line_start": 88,
          "suggested_fix": "Указать, что результат — это внедрённая и протестированная система, переданная на электронных носителях с документацией в PDF, актом сдачи-приёмки после успешного прохождения ОПЭ."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E11",
      "process_analysis": "Многие требования в ТЗ не измеримы: например, «повысить скорость», «надёжность», «энергоэффективность» — без числовых критериев, диапазонов или ссылок на стандарты. Нет указания, как проверить выполнение: на сколько повысить скорость, какой уровень надёжности (например, время безотказной работы), как измерить энергоэффективность.",
      "instances": [
        {
          "snippet": "[086] Повысить скорость процесса контроля качества поверхности и измерения геометрических размеров листового проката для повышения производительности цеха.",
          "err_type": "invalid",
          "line_end": 86,
          "rationale": "Без числового критерия невозможно проверить достижение цели.",
          "line_start": 86,
          "suggested_fix": "Указать конкретный показатель: например, «сократить время контроля до X секунд на лист» или «увеличить пропускную способность до Y листов в час» с методикой измерения."
        },
        {
          "snippet": "[4.10 Требования к надежности 24](#_Toc205454765)",
          "err_type": "invalid",
          "line_end": 41,
          "rationale": "Слово «надёжность» без метрики не позволяет проверить выполнение требования.",
          "line_start": 41,
          "suggested_fix": "Добавить измеримый критерий: например, «среднее время наработки на отказ — не менее 10000 часов» или ссылку на ГОСТ по надёжности."
        },
        {
          "snippet": "[4.6 Требования к энергоэффективности 17](#_Toc205454761)",
          "err_type": "invalid",
          "line_end": 33,
          "rationale": "Требование без числового значения или методики измерения не подлежит контролю.",
          "line_start": 33,
          "suggested_fix": "Указать: «потребляемая мощность системы — не более X кВт» или «класс энергоэффективности — A+ по ГОСТ ...»."
        }
      ]
    },
    {
      "group_id": "G09",
      "error_code": "E21",
      "process_analysis": "Упоминается необходимость повышения производительности, но отсутствуют числовые значения, диапазоны или минимальные/максимальные уровни производительности оборудования. Нет единиц измерения (например, листов в час, метров в минуту). Присутствуют только качественные формулировки.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E21 нарушено: отсутствует числовой показатель производительности с единицами измерения и границами.",
          "line_start": null,
          "suggested_fix": "Добавить требование к производительности, например: «Система должна обрабатывать не менее X листов в час при скорости прокатки до Y м/мин»."
        }
      ]
    },
    {
      "group_id": "G09",
      "error_code": "E22",
      "process_analysis": "В документе отсутствует перечень функциональных характеристик оборудования (температура, давление, вибрация, шум, скорость и т.п.) с предельными или оптимальными значениями. Нет указания диапазонов, единиц измерения или ссылок на стандарты. Упоминается только интеграция, но не технические параметры работы.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E22 нарушено: отсутствуют предельные или оптимальные значения функциональных характеристик оборудования.",
          "line_start": null,
          "suggested_fix": "Добавить таблицу с функциональными характеристиками: рабочая температура, влажность, вибрация, уровень шума, скорость обработки изображений, с указанием min/max значений и единиц измерения."
        }
      ]
    },
    {
      "group_id": "G09",
      "error_code": "E23",
      "process_analysis": "Раздел 4.9 «Требования к команде Подрядчика» упоминается в оглавлении, но в тексте отсутствует. Нет ни одного упоминания о СРО, лицензиях, допусках или разрешительных документах. Требование к разрешительным документам полностью отсутствует.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E23 нарушено: отсутствует указание на необходимость СРО или лицензии с перечнем кодов.",
          "line_start": null,
          "suggested_fix": "Добавить требование о наличии у Подрядчика свидетельства СРО в области инжиниринга или лицензии на разработку ПО, с указанием кодов ОКВЭД и ссылкой на реестр."
        }
      ]
    },
    {
      "group_id": "G09",
      "error_code": "E24",
      "process_analysis": "Раздел 4.9 «Требования к команде Подрядчика» объявлен, но пуст. Нет информации о количестве персонала, его квалификации (разряды, стаж, профиль) или документах, подтверждающих квалификацию. Все три обязательных элемента отсутствуют.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E24 нарушено: отсутствует информация о численности, квалификации и документах подрядчика.",
          "line_start": null,
          "suggested_fix": "Добавить в раздел 4.9 количество и квалификацию персонала (например, 2 инженера по ПО, стаж не менее 5 лет), с перечнем документов: дипломы, сертификаты, удостоверения."
        }
      ]
    },
    {
      "group_id": "G09",
      "error_code": "E25",
      "process_analysis": "В документе нет ни одного упоминания о материально-технической базе подрядчика. Отсутствует перечень оборудования, инструментов, моделей, параметров, количества или формы владения. Нет ссылок на паспорта, сертификаты или договоры аренды.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E25 нарушено: отсутствует описание состава и подтверждения наличия материально-технической базы подрядчика.",
          "line_start": null,
          "suggested_fix": "Добавить раздел с перечнем необходимой МТБ: типы камер, серверов, ПО, с параметрами, количеством и формой владения, с требованием предоставить договоры или сертификаты."
        }
      ]
    },
    {
      "group_id": "G08",
      "error_code": "E17",
      "process_analysis": "Раздел 4.13 называется «Требования к тестированию и приемке ИС», что формально указывает на наличие темы приёмки. Однако в предоставленной части документа (до строки 110) содержание этого раздела не раскрыто — присутствует только заголовок. Следовательно, невозможно подтвердить наличие этапов, ответственных, документов, сроков и критериев. Это соответствует нарушению типа «missing», так как содержимое раздела отсутствует.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Раздел с заголовком присутствует, но его содержание отсутствует в документе, что делает невозможным проверку полноты требований к приёмке.",
          "line_start": null,
          "suggested_fix": "Добавить в раздел 4.13 описание этапов приёмки, ответственных лиц, форм актов (например, КС-2, КС-3), сроков устранения замечаний и измеримых критериев соответствия."
        }
      ]
    },
    {
      "group_id": "G04",
      "error_code": "E07",
      "process_analysis": "В документе отсутствуют какие-либо упоминания условий эксплуатации для закупаемого оборудования: нет данных о климатических, механических, электрических, химических или вибрационных нагрузках, отсутствуют диапазоны температур, влажности, степени защиты IP, ссылки на стандарты. Таким образом, невозможно оценить пригодность предлагаемого оборудования для работы в условиях ЛПЦ-1.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование необходимо для обеспечения сопоставимости предложений поставщиков и подтверждения пригодности оборудования к работе в условиях промышленного цеха.",
          "line_start": null,
          "suggested_fix": "Добавить подраздел «Условия эксплуатации оборудования» с указанием температурного диапазона, влажности, запыленности, вибраций, степени защиты IP, параметров электропитания, ссылаясь на ГОСТ 15150, ГОСТ 14254 и др."
        }
      ]
    }
  ]
}