{
  "version_id": "71cc63cf-8f08-463c-94a9-414bbbdac432",
  "items": [
    {
      "group_id": "G04",
      "error_code": "E08",
      "process_analysis": "В документе отсутствует отдельный раздел с условиями выполнения работ: нет точной локации (кроме упоминаний складов), графика, окон доступа, порядка допуска или требований безопасности. Упоминания связаны с логистикой, а не с условиями оказания услуг.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E08 требует чёткого описания условий оказания услуг, которые в документе не представлены.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Условия выполнения работ» с указанием точной локации (адрес, цех, склад), графика (смены, окна), порядка допуска, пропусков и требований безопасности."
        }
      ]
    },
    {
      "group_id": "G07",
      "error_code": "E14",
      "process_analysis": "В документе перечислены формы ввода, но отсутствует раздел «Приложения» с официальными названиями и ссылками на прилагаемые документы. Упоминания форм (например, «Формирование ПСО», «Плавочная карточка») не сопровождаются указанием на приложение или ссылку. Нет подтверждения, что документы приложены или доступны в открытом доступе.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Без приложений или ссылок на них ТЗ не является целостным: невозможно проверить соответствие системы требованиям по документам.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Приложения» с перечнем всех упомянутых документов (например, «Форма ПСО», «Плавочная карточка»), указать их официальные названия, статус (в приложении или в открытом доступе) и приложить файлы или дать рабочие ссылки."
        }
      ]
    },
    {
      "group_id": "G07",
      "error_code": "E18",
      "process_analysis": "В ТЗ отсутствует выделенный раздел или приложение, описывающее структуру, формат и содержание технического предложения. Нет указаний на обязательные разделы, порядок подачи, форматы файлов, правила оформления графики или подписей.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Отсутствие таких требований не позволяет участникам единообразно подготовить технико-коммерческое предложение, что нарушает прозрачность закупки.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Требования к техническому предложению» с перечнем обязательных разделов, форматами файлов (PDF, XLSX), правилами нумерации, требованиями к графикам и подписям."
        }
      ]
    },
    {
      "group_id": "G02",
      "error_code": "E02",
      "process_analysis": "Заголовок содержит аббревиатуру «ИС» и «MES НТПЗ», которые не раскрыты в названии. Отсутствует глагол действия (например, «разработка») в сочетании с объектом. Формулировка избыточна и не соответствует шаблону «действие + объект». В названии — только «Техническое задание», что слишком обобщено.",
      "instances": [
        {
          "snippet": "**Техническое задание на разработку программного обеспечения**\n\n**ИС « MES НТПЗ».**",
          "err_type": "invalid",
          "line_end": 11,
          "rationale": "Требуется конкретное действие и раскрытый объект без внутренних индексов. Текущий заголовок двусмыслен и содержит нераскрытые аббревиатуры.",
          "line_start": 9,
          "suggested_fix": "Заменить на: «Разработка программного обеспечения для MES-системы Новотроицкого трубопрокатного завода». Убрать дублирующий заголовок и нераскрытые аббревиатуры."
        }
      ]
    },
    {
      "group_id": "G02",
      "error_code": "E03",
      "process_analysis": "В документе отсутствует отдельный раздел «Предмет ТЗ» или его синонимы (например, «Состав поставки»). Информация о предмете рассыпана по тексту: упоминается разработка ПО, но нет структурированного перечня объектов, работ, документов. Нет явного выделения групп: ПО, сопутствующие услуги, документация.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Без явного раздела невозможно однозначно определить состав поставки, что нарушает требования к прозрачности и полноте закупки.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Предмет ТЗ» после титула. Включить: 1) разработка ПО для MES-системы; 2) внедрение, настройка, обучение; 3) техническая документация, инструкции, электронные ключи."
        }
      ]
    },
    {
      "group_id": "G01",
      "error_code": "E01A",
      "process_analysis": "В тексте встречаются зачеркнутые слова (~~бракуют~~, ~~Брак~~), что указывает на редакторскую правку, но неудалённые фрагменты. Это создаёт стилистическую и смысловую неоднозначность. Также в [153] пропущена запятая после вводного оборота и нарушено согласование: \"Задача редукционно-растяжного - получение...\" — требуется тире или запятая, корректнее: \"редукционно-растяжного стана — получение\".",
      "instances": [
        {
          "snippet": "Задача редукционно-растяжного - получение необработанной трубы",
          "err_type": "invalid",
          "line_end": 153,
          "rationale": "Нарушено согласование подлежащего и сказуемого, отсутствует тире, пропущено слово.",
          "line_start": 153,
          "suggested_fix": "Заменить на: \"Задача редукционно-растяжного стана — получение необработанной трубы\". Добавить тире и слово \"стана\"."
        },
        {
          "snippet": "~~бракуют~~, передают со склада",
          "err_type": "invalid",
          "line_end": 151,
          "rationale": "Некорректное редактирование: зачёркнутый текст не удалён, нарушает читаемость.",
          "line_start": 151,
          "suggested_fix": "Удалить зачёркнутое слово \"~~бракуют~~\". Оставить: \"переводят в лом, передают...\""
        },
        {
          "snippet": "~~Брак~~ Несоответствующую продукцию",
          "err_type": "invalid",
          "line_end": 153,
          "rationale": "Остатки редакторской правки искажают текст и создают дублирование смысла.",
          "line_start": 153,
          "suggested_fix": "Удалить \"~~Брак~~\". Оставить: \"Несоответствующую продукцию, образованную на редукционно-растяжном стане, переводят в лом...\""
        }
      ]
    },
    {
      "group_id": "G01",
      "error_code": "E01B",
      "process_analysis": "В оглавлении указан раздел \"1. Общие требования\", но в тексте заголовок [131] оформлен как \"1. **Текущий бизнес-процесс НТПЗ**\", что противоречит содержанию. Также в оглавлении раздел 2 начинается с [033], но в тексте [131] уже идёт описание бизнес-процесса без предварительного введения. Нарушена логическая последовательность: сначала оглавление, затем термины, потом снова общие требования, но в тексте раздел 1 отсутствует, а сразу идёт бизнес-процесс. Это создаёт разрыв логики.",
      "instances": [
        {
          "snippet": "1. **Текущий бизнес-процесс НТПЗ**",
          "err_type": "invalid",
          "line_end": 131,
          "rationale": "Несоответствие между оглавлением и фактической нумерацией нарушает логическую последовательность.",
          "line_start": 131,
          "suggested_fix": "Заменить на: \"2. Текущий бизнес-процесс НТПЗ\" или перенумеровать оглавление. Убедиться, что структура соответствует оглавлению."
        },
        {
          "snippet": "[033] [2. Текущий бизнес-процесс 4](#_Toc204353413)",
          "err_type": "invalid",
          "line_end": 33,
          "rationale": "Гиперссылка в оглавлении ведёт на несуществующий или неправильно оформленный заголовок, что нарушает навигацию и логику.",
          "line_start": 33,
          "suggested_fix": "Убедиться, что в тексте раздел 2 начинается с заголовка уровня 2. Проверить соответствие гиперссылок и реальных заголовков."
        }
      ]
    },
    {
      "group_id": "G05",
      "error_code": "E09",
      "process_analysis": "Во всём документе отсутствуют заголовки, колонки, таблицы или маркеры, разделяющие требования на обязательные и желательные. Все формулировки изложены единообразно, без визуального или семантического разделения. Нет ни отдельных разделов, ни унифицированных меток (например, «Обязательно», «Желательно»). Это нарушает требование E09.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E09 предполагает явное визуальное или структурное разделение требований по приоритетам. В документе такое разделение отсутствует, что затрудняет оценку критичности требований для поставщиков.",
          "line_start": null,
          "suggested_fix": "Добавить разделение требований на обязательные и желательные, выделив их отдельными подразделами или добавив унифицированные метки (например, «ОБЯЗ» и «ЖЕЛАТ») к каждому требованию."
        }
      ]
    },
    {
      "group_id": "G05",
      "error_code": "E10",
      "process_analysis": "У каждого требования отсутствует единообразная метка приоритета («обязательное»/«желательное»). Все требования сформулированы с использованием модальности «должна», но нет ни единой метки, указывающей на категорию. Это нарушает E10, так как отсутствие маркировки у любого требования считается ошибкой.",
      "instances": [
        {
          "snippet": "[237] Требования к режимам функционирования системы . MES-система должна поддерживать основной режим...",
          "err_type": "invalid",
          "line_end": 237,
          "rationale": "Требование E10 требует единообразной и явной маркировки каждого требования. Отсутствие такой маркировки делает невозможным однозначную интерпретацию приоритета.",
          "line_start": 237,
          "suggested_fix": "Добавить колонку или метку (например, «ОБЯЗ») после каждого требования, явно указывающую его приоритет. Для желательных — использовать «ЖЕЛАТ». Все требования должны быть помечены."
        }
      ]
    },
    {
      "group_id": "G05",
      "error_code": "E12",
      "process_analysis": "В документе все требования сформулированы с использованием обязательной лексики («должна», «необходимо»), но отсутствуют формулировки с желательной модальностью («желательно», «предпочтительно»). Однако в одном блоке смешиваются требования разного характера: базовые функции и перспективные возможности (расширение пользователей, производительности). Последние логически относятся к желательным, но изложены как обязательные — это создаёт двусмысленность.",
      "instances": [
        {
          "snippet": "[237] В порядке развития должна быть предусмотрена возможность расширения и увеличения количества пользователей. Также необходимо предусмотреть возможность увеличения производительности системы, расширения емкости хранения данных.",
          "err_type": "invalid",
          "line_end": 237,
          "rationale": "Требования к будущему развитию системы логически относятся к желательным, но изложены с обязательной лексикой, что создаёт ложное ограничение и двусмысленность для поставщика.",
          "line_start": 237,
          "suggested_fix": "Разделить требования: обязательные — в отдельный список, желательные (расширяемость) — в другой с меткой «ЖЕЛАТ». Убрать модальность «должна» для оценочных требований."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E04",
      "process_analysis": "В документе присутствует таблица форм ввода, которая частично выполняет функцию перечня работ. Однако она охватывает только функции ввода данных, не включая полный спектр работ по разработке ПО: проектирование, тестирование, внедрение, обучение, сопровождение. Также отсутствуют МТР (например, серверы, лицензии) и услуги (например, интеграция с другими системами), упомянутые в контексте, но не вынесенные в отдельный перечень. Использование аббревиатур (например, ПСО, ВТК) без расшифровки в этом разделе затрудняет идентификацию.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Без полного перечня невозможно оценить объем закупки и сравнить предложения участников.",
          "line_start": null,
          "suggested_fix": "Добавить отдельный раздел «Перечень работ и услуг» с перечислением всех этапов: разработка архитектуры, реализация модулей, интеграция, тестирование, внедрение, обучение, сопровождение. Включить МТР: серверы, лицензии ПО, сетевое оборудование."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E05",
      "process_analysis": "В документе отсутствует любой упоминание объема поставки: количество форм, модулей, пользователей, серверов, лицензий, трудозатрат. В таблице форм ввода перечислены функции, но без указания количества (например, сколько форм, сколько модулей). Нет методики расчета объема (например, по числу участков или операций). Отсутствуют единицы измерения и формулы.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Отсутствие объема нарушает прозрачность закупки и создает риски скрытых расходов.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Объемы работ и поставки» с указанием количества форм (35), модулей (например, 5), серверов (2), лицензий, пользователей (150), трудозатрат (в чел-часах) или ссылкой на методику их расчета."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E06",
      "process_analysis": "В ТЗ отсутствует явное описание конечного результата. Упоминается цель — разработка ТКП, но не указан результат выполнения работ по созданию ПО. Нет формулировок вроде «результатом является», «передаётся заказчику», «акт сдачи-приёмки». Не указано, что именно будет сдано: программный модуль, документация, база данных, в каком формате и когда. Нет критериев приемки: например, успешное прохождение тестов, демонстрация функций.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Без явного результата невозможно однозначно определить момент завершения работ и основания для приемки.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Результат выполнения работ» с указанием: передача ПО в виде установочного пакета и исходных кодов, документации (в PDF), акта сдачи-приёмки, успешного прохождения тестов и демонстрации функций в течение 10 рабочих дней после завершения."
        }
      ]
    },
    {
      "group_id": "G03",
      "error_code": "E11",
      "process_analysis": "Многие требования сформулированы качественно, без измеримых критериев. Например, «эффективность», «надежность», «оптимизация» — не имеют числовых метрик или ссылок на стандарты. В разделе 4.2 «Производительность» отсутствует, несмотря на наличие подраздела. Требования к безопасности (4.3) не содержат нормативов (ГОСТ, ISO) или методик проверки. Формулировки вроде «должна поддерживать» не имеют способа верификации.",
      "instances": [
        {
          "snippet": "[127] ...для обеспечения эффективности, надежности, информационной безопасности и оптимизации производственных мощностей.",
          "err_type": "invalid",
          "line_end": 127,
          "rationale": "Качественные термины не позволяют однозначно проверить выполнение требований.",
          "line_start": 127,
          "suggested_fix": "Заменить на измеримые критерии: например, «система должна обрабатывать до 1000 операций в минуту», «время восстановления после сбоя — не более 15 минут», «соответствие требованиям ГОСТ Р 57580.1-2017 по ИБ»."
        }
      ]
    },
    {
      "group_id": "G08",
      "error_code": "E17",
      "process_analysis": "В документе упоминается процесс приемки труб контролерами ОТК и оформление сертификата качества, но отсутствует отдельный структурированный раздел по приёмке работ, услуг или МТР. Нет описания этапов контроля, ответственных сторон с должностями, форм актов, сроков устранения замечаний и измеримых критериев. Упоминания фрагментарны и относятся только к производственной приемке, а не к приёмке разработки ПО.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Отсутствует любой структурированный раздел по приёмке работ, услуг или МТР, что нарушает требование E17.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Приёмка работ», включающий этапы контроля, ответственных (должности, организации), формы актов (например, акт КС-2), сроки устранения замечаний и измеримые критерии соответствия (например, покрытие тестами не менее 95%)."
        }
      ]
    },
    {
      "group_id": "G08",
      "error_code": "E27",
      "process_analysis": "В документе отсутствует любой упоминание проектно-сметной документации (ПСД), её состава, объёма работ или сроков. Нет ни списка, ни таблицы с перечнем проектных работ, нет единиц измерения (листы, часы), нет календарных сроков. Разделы 5 и 6 обозначены, но содержат ошибки в нумерации и пусты.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "В ТЗ полностью отсутствует информация о составе, объёме и сроках готовности ПСД, что нарушает требование E27.",
          "line_start": null,
          "suggested_fix": "Добавить раздел «Проектно-сметная документация» с перечнем работ (обследование, проектирование, разработка, тестирование), ориентировочным объёмом в часах или листах и сроками готовности по этапам (например, «Предпроектная стадия — до 30.04.2025»)."
        }
      ]
    },
    {
      "group_id": "G06",
      "error_code": "E13",
      "process_analysis": "В строке [125] упоминается «технико-коммерческое предложение», что относится к коммерческой составляющей. Это нарушение, так как техническое задание не должно содержать ссылок на формирование коммерческого предложения.",
      "instances": [
        {
          "snippet": "[125]  Настоящее техническое задание предназначено для разработки технико-коммерческого предложения на создание программного обеспечения",
          "err_type": "invalid",
          "line_end": 125,
          "rationale": "Упоминание КП в техническом задании нарушает принцип независимости от коммерческих условий.",
          "line_start": 125,
          "suggested_fix": "Заменить «технико-коммерческого предложения» на «проектной документации» или «решения»."
        }
      ]
    },
    {
      "group_id": "G04",
      "error_code": "E07",
      "process_analysis": "В документе отсутствуют любые упоминания условий эксплуатации МТР: нет данных о климатических, электрических, механических или химических параметрах. Упоминание режимов функционирования системы касается ПО, а не оборудования. Нет ссылок на стандарты, диапазонов значений или единиц измерения.",
      "instances": [
        {
          "snippet": null,
          "err_type": "missing",
          "line_end": null,
          "rationale": "Требование E07 предполагает детализацию условий для МТР, которые в документе не указаны ни для одного оборудования.",
          "line_start": null,
          "suggested_fix": "Добавить подраздел «Условия эксплуатации оборудования», указать температурный диапазон, влажность, запыленность, требования по IP, вибрациям, электропитанию с единицами измерения и ссылками на ГОСТ 15150, ГОСТ 14254 и др."
        }
      ]
    }
  ]
}